#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-LesDwXPVqxkFXeJE

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/373.f0584962.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.map"]: Refreshing state... [id=static/js/main.83bd2d10.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js"]: Refreshing state... [id=static/js/main.83bd2d10.js]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js"]: Refreshing state... [id=static/js/106.66034d11.chunk.js]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js.map"]: Refreshing state... [id=static/js/373.f0584962.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js.map"]: Refreshing state... [id=static/js/777.4dc86836.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/463.ffa5fc90.chunk.css.map"]: Refreshing state... [id=static/css/463.ffa5fc90.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js.map"]: Refreshing state... [id=static/js/106.66034d11.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/924.eae530bc.chunk.js.map"]: Refreshing state... [id=static/js/924.eae530bc.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/924.eae530bc.chunk.js"]: Refreshing state... [id=static/js/924.eae530bc.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js"]: Refreshing state... [id=static/js/777.4dc86836.chunk.js]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/463.9981da85.chunk.js"]: Refreshing state... [id=static/js/463.9981da85.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.23200c89.chunk.js"]: Refreshing state... [id=static/js/726.23200c89.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/726.23200c89.chunk.js.map"]: Refreshing state... [id=static/js/726.23200c89.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/463.ffa5fc90.chunk.css"]: Refreshing state... [id=static/css/463.ffa5fc90.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css"]: Refreshing state... [id=static/css/main.dce9ee63.css]
module.web.aws_s3_object.upload_webapp["static/js/463.9981da85.chunk.js.map"]: Refreshing state... [id=static/js/463.9981da85.chunk.js.map]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js"]: Refreshing state... [id=static/js/373.f0584962.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css.map"]: Refreshing state... [id=static/css/main.dce9ee63.css.map]
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.83bd2d10.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/463.9981da85.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/463.9981da85.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.map"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "df40ce84425eef06ca376d1593d8cabb" -> "0177f5e0d00b57505543bb5e479d7d6a"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "kga_8VQPR.HAu2g9rZ39izsJDloBqkVX" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "85be4e7c139cc26b9b5c65bd6f2602b3" -> "32ad90d169d3fe147f296ec33f7a4da4"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "oAUVrzWdu52OTdzU4BtKJEcxtcRJlFnA" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js"] will be destroyed
  # (because key ["static/js/main.83bd2d10.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "2b8e48f9093a3ccade6cad7fc422e61a" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.83bd2d10.js" -> null
      - key                    = "static/js/main.83bd2d10.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.83bd2d10.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "1P7OrEo4ieWXPNBZIodjwIWSngnhg_0f" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.83bd2d10.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "ad1529f76e3e9c44d0f3385f7571ad68" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.83bd2d10.js.LICENSE.txt" -> null
      - key                    = "static/js/main.83bd2d10.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.83bd2d10.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "S7.hcI375SuJJA25Se68RKtvCcIjLiPC" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.map"] will be destroyed
  # (because key ["static/js/main.83bd2d10.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "fcb954ab6ad67f9509f6dfdc06be5e00" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.83bd2d10.js.map" -> null
      - key                    = "static/js/main.83bd2d10.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.83bd2d10.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "chcfM8BQfbgwTJVyO2GlB8yBSjl3iY6U" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9745b6b4.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "ed4fb48e6828f80734e7550dddf61ba1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.9745b6b4.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.9745b6b4.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9745b6b4.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "ad1529f76e3e9c44d0f3385f7571ad68"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.9745b6b4.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.9745b6b4.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9745b6b4.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "2fe2595000bbf0204dcdbdeda5da7863"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.9745b6b4.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.9745b6b4.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 37 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*